{
  "metadata": {
    "total_size": 40668637184
  },
  "weight_map": {
    "model.decoder.embed_tokens.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.0.cross_attn.k_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.0.cross_attn.o_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.0.cross_attn.q_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.0.cross_attn.v_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.0.mlp.down_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.0.mlp.gate_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.0.mlp.up_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.0.post_cross_attn_layernorm.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.0.post_feedforward_layernorm.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.0.post_self_attn_layernorm.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.0.pre_cross_attn_layernorm.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.0.pre_feedforward_layernorm.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.0.pre_self_attn_layernorm.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.0.self_attn.k_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.0.self_attn.o_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.0.self_attn.q_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.0.self_attn.v_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.1.cross_attn.k_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.1.cross_attn.o_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.1.cross_attn.q_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.1.cross_attn.v_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.1.mlp.down_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.1.mlp.gate_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.1.mlp.up_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.1.post_cross_attn_layernorm.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.1.post_feedforward_layernorm.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.1.post_self_attn_layernorm.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.1.pre_cross_attn_layernorm.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.1.pre_feedforward_layernorm.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.1.pre_self_attn_layernorm.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.1.self_attn.k_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.1.self_attn.o_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.1.self_attn.q_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.1.self_attn.v_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.10.cross_attn.k_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.10.cross_attn.o_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.10.cross_attn.q_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.10.cross_attn.v_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.10.mlp.down_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.10.mlp.gate_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.10.mlp.up_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.10.post_cross_attn_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.10.post_feedforward_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.10.post_self_attn_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.10.pre_cross_attn_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.10.pre_feedforward_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.10.pre_self_attn_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.10.self_attn.k_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.10.self_attn.o_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.10.self_attn.q_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.10.self_attn.v_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.11.cross_attn.k_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.11.cross_attn.o_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.11.cross_attn.q_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.11.cross_attn.v_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.11.mlp.down_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.11.mlp.gate_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.11.mlp.up_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.11.post_cross_attn_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.11.post_feedforward_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.11.post_self_attn_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.11.pre_cross_attn_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.11.pre_feedforward_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.11.pre_self_attn_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.11.self_attn.k_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.11.self_attn.o_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.11.self_attn.q_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.11.self_attn.v_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.12.cross_attn.k_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.12.cross_attn.o_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.12.cross_attn.q_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.12.cross_attn.v_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.12.mlp.down_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.12.mlp.gate_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.12.mlp.up_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.12.post_cross_attn_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.12.post_feedforward_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.12.post_self_attn_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.12.pre_cross_attn_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.12.pre_feedforward_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.12.pre_self_attn_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.12.self_attn.k_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.12.self_attn.o_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.12.self_attn.q_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.12.self_attn.v_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.13.cross_attn.k_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.13.cross_attn.o_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.13.cross_attn.q_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.13.cross_attn.v_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.13.mlp.down_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.13.mlp.gate_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.13.mlp.up_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.13.post_cross_attn_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.13.post_feedforward_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.13.post_self_attn_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.13.pre_cross_attn_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.13.pre_feedforward_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.13.pre_self_attn_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.13.self_attn.k_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.13.self_attn.o_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.13.self_attn.q_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.13.self_attn.v_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.14.cross_attn.k_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.14.cross_attn.o_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.14.cross_attn.q_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.14.cross_attn.v_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.14.mlp.down_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.14.mlp.gate_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.14.mlp.up_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.14.post_cross_attn_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.14.post_feedforward_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.14.post_self_attn_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.14.pre_cross_attn_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.14.pre_feedforward_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.14.pre_self_attn_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.14.self_attn.k_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.14.self_attn.o_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.14.self_attn.q_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.14.self_attn.v_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.15.cross_attn.k_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.15.cross_attn.o_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.15.cross_attn.q_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.15.cross_attn.v_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.15.mlp.down_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.15.mlp.gate_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.15.mlp.up_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.15.post_cross_attn_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.15.post_feedforward_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.15.post_self_attn_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.15.pre_cross_attn_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.15.pre_feedforward_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.15.pre_self_attn_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.15.self_attn.k_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.15.self_attn.o_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.15.self_attn.q_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.15.self_attn.v_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.16.cross_attn.k_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.16.cross_attn.o_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.16.cross_attn.q_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.16.cross_attn.v_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.16.mlp.down_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.16.mlp.gate_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.16.mlp.up_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.16.post_cross_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.16.post_feedforward_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.16.post_self_attn_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.16.pre_cross_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.16.pre_feedforward_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.16.pre_self_attn_layernorm.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.16.self_attn.k_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.16.self_attn.o_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.16.self_attn.q_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.16.self_attn.v_proj.weight": "model-00006-of-00009.safetensors",
    "model.decoder.layers.17.cross_attn.k_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.17.cross_attn.o_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.17.cross_attn.q_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.17.cross_attn.v_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.17.mlp.down_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.17.mlp.gate_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.17.mlp.up_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.17.post_cross_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.17.post_feedforward_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.17.post_self_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.17.pre_cross_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.17.pre_feedforward_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.17.pre_self_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.17.self_attn.k_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.17.self_attn.o_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.17.self_attn.q_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.17.self_attn.v_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.18.cross_attn.k_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.18.cross_attn.o_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.18.cross_attn.q_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.18.cross_attn.v_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.18.mlp.down_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.18.mlp.gate_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.18.mlp.up_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.18.post_cross_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.18.post_feedforward_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.18.post_self_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.18.pre_cross_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.18.pre_feedforward_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.18.pre_self_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.18.self_attn.k_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.18.self_attn.o_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.18.self_attn.q_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.18.self_attn.v_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.19.cross_attn.k_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.19.cross_attn.o_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.19.cross_attn.q_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.19.cross_attn.v_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.19.mlp.down_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.19.mlp.gate_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.19.mlp.up_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.19.post_cross_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.19.post_feedforward_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.19.post_self_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.19.pre_cross_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.19.pre_feedforward_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.19.pre_self_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.19.self_attn.k_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.19.self_attn.o_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.19.self_attn.q_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.19.self_attn.v_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.2.cross_attn.k_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.2.cross_attn.o_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.2.cross_attn.q_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.2.cross_attn.v_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.2.mlp.down_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.2.mlp.gate_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.2.mlp.up_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.2.post_cross_attn_layernorm.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.2.post_feedforward_layernorm.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.2.post_self_attn_layernorm.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.2.pre_cross_attn_layernorm.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.2.pre_feedforward_layernorm.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.2.pre_self_attn_layernorm.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.2.self_attn.k_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.2.self_attn.o_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.2.self_attn.q_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.2.self_attn.v_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.20.cross_attn.k_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.20.cross_attn.o_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.20.cross_attn.q_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.20.cross_attn.v_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.20.mlp.down_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.20.mlp.gate_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.20.mlp.up_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.20.post_cross_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.20.post_feedforward_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.20.post_self_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.20.pre_cross_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.20.pre_feedforward_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.20.pre_self_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.20.self_attn.k_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.20.self_attn.o_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.20.self_attn.q_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.20.self_attn.v_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.21.cross_attn.k_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.21.cross_attn.o_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.21.cross_attn.q_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.21.cross_attn.v_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.21.mlp.down_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.21.mlp.gate_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.21.mlp.up_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.21.post_cross_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.21.post_feedforward_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.21.post_self_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.21.pre_cross_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.21.pre_feedforward_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.21.pre_self_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.21.self_attn.k_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.21.self_attn.o_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.21.self_attn.q_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.21.self_attn.v_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.22.cross_attn.k_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.22.cross_attn.o_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.22.cross_attn.q_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.22.cross_attn.v_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.22.mlp.down_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.22.mlp.gate_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.22.mlp.up_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.22.post_cross_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.22.post_feedforward_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.22.post_self_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.22.pre_cross_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.22.pre_feedforward_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.22.pre_self_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.22.self_attn.k_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.22.self_attn.o_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.22.self_attn.q_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.22.self_attn.v_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.23.cross_attn.k_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.23.cross_attn.o_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.23.cross_attn.q_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.23.cross_attn.v_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.23.mlp.down_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.23.mlp.gate_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.23.mlp.up_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.23.post_cross_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.23.post_feedforward_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.23.post_self_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.23.pre_cross_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.23.pre_feedforward_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.23.pre_self_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.23.self_attn.k_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.23.self_attn.o_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.23.self_attn.q_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.23.self_attn.v_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.24.cross_attn.k_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.24.cross_attn.o_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.24.cross_attn.q_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.24.cross_attn.v_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.24.mlp.down_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.24.mlp.gate_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.24.mlp.up_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.24.post_cross_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.24.post_feedforward_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.24.post_self_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.24.pre_cross_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.24.pre_feedforward_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.24.pre_self_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.24.self_attn.k_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.24.self_attn.o_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.24.self_attn.q_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.24.self_attn.v_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.25.cross_attn.k_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.25.cross_attn.o_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.25.cross_attn.q_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.25.cross_attn.v_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.25.mlp.down_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.25.mlp.gate_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.25.mlp.up_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.25.post_cross_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.25.post_feedforward_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.25.post_self_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.25.pre_cross_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.25.pre_feedforward_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.25.pre_self_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.25.self_attn.k_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.25.self_attn.o_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.25.self_attn.q_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.25.self_attn.v_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.26.cross_attn.k_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.26.cross_attn.o_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.26.cross_attn.q_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.26.cross_attn.v_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.26.mlp.down_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.26.mlp.gate_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.26.mlp.up_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.26.post_cross_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.26.post_feedforward_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.26.post_self_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.26.pre_cross_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.26.pre_feedforward_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.26.pre_self_attn_layernorm.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.26.self_attn.k_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.26.self_attn.o_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.26.self_attn.q_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.26.self_attn.v_proj.weight": "model-00007-of-00009.safetensors",
    "model.decoder.layers.27.cross_attn.k_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.27.cross_attn.o_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.27.cross_attn.q_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.27.cross_attn.v_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.27.mlp.down_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.27.mlp.gate_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.27.mlp.up_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.27.post_cross_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.27.post_feedforward_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.27.post_self_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.27.pre_cross_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.27.pre_feedforward_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.27.pre_self_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.27.self_attn.k_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.27.self_attn.o_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.27.self_attn.q_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.27.self_attn.v_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.28.cross_attn.k_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.28.cross_attn.o_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.28.cross_attn.q_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.28.cross_attn.v_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.28.mlp.down_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.28.mlp.gate_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.28.mlp.up_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.28.post_cross_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.28.post_feedforward_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.28.post_self_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.28.pre_cross_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.28.pre_feedforward_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.28.pre_self_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.28.self_attn.k_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.28.self_attn.o_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.28.self_attn.q_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.28.self_attn.v_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.29.cross_attn.k_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.29.cross_attn.o_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.29.cross_attn.q_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.29.cross_attn.v_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.29.mlp.down_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.29.mlp.gate_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.29.mlp.up_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.29.post_cross_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.29.post_feedforward_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.29.post_self_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.29.pre_cross_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.29.pre_feedforward_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.29.pre_self_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.29.self_attn.k_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.29.self_attn.o_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.29.self_attn.q_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.29.self_attn.v_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.3.cross_attn.k_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.3.cross_attn.o_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.3.cross_attn.q_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.3.cross_attn.v_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.3.mlp.down_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.3.mlp.gate_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.3.mlp.up_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.3.post_cross_attn_layernorm.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.3.post_feedforward_layernorm.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.3.post_self_attn_layernorm.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.3.pre_cross_attn_layernorm.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.3.pre_feedforward_layernorm.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.3.pre_self_attn_layernorm.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.3.self_attn.k_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.3.self_attn.o_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.3.self_attn.q_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.3.self_attn.v_proj.weight": "model-00005-of-00009.safetensors",
    "model.decoder.layers.30.cross_attn.k_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.30.cross_attn.o_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.30.cross_attn.q_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.30.cross_attn.v_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.30.mlp.down_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.30.mlp.gate_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.30.mlp.up_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.30.post_cross_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.30.post_feedforward_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.30.post_self_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.30.pre_cross_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.30.pre_feedforward_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.30.pre_self_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.30.self_attn.k_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.30.self_attn.o_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.30.self_attn.q_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.30.self_attn.v_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.31.cross_attn.k_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.31.cross_attn.o_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.31.cross_attn.q_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.31.cross_attn.v_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.31.mlp.down_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.31.mlp.gate_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.31.mlp.up_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.31.post_cross_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.31.post_feedforward_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.31.post_self_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.31.pre_cross_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.31.pre_feedforward_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.31.pre_self_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.31.self_attn.k_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.31.self_attn.o_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.31.self_attn.q_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.31.self_attn.v_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.32.cross_attn.k_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.32.cross_attn.o_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.32.cross_attn.q_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.32.cross_attn.v_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.32.mlp.down_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.32.mlp.gate_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.32.mlp.up_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.32.post_cross_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.32.post_feedforward_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.32.post_self_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.32.pre_cross_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.32.pre_feedforward_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.32.pre_self_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.32.self_attn.k_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.32.self_attn.o_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.32.self_attn.q_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.32.self_attn.v_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.33.cross_attn.k_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.33.cross_attn.o_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.33.cross_attn.q_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.33.cross_attn.v_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.33.mlp.down_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.33.mlp.gate_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.33.mlp.up_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.33.post_cross_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.33.post_feedforward_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.33.post_self_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.33.pre_cross_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.33.pre_feedforward_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.33.pre_self_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.33.self_attn.k_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.33.self_attn.o_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.33.self_attn.q_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.33.self_attn.v_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.34.cross_attn.k_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.34.cross_attn.o_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.34.cross_attn.q_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.34.cross_attn.v_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.34.mlp.down_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.34.mlp.gate_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.34.mlp.up_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.34.post_cross_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.34.post_feedforward_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.34.post_self_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.34.pre_cross_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.34.pre_feedforward_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.34.pre_self_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.34.self_attn.k_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.34.self_attn.o_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.34.self_attn.q_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.34.self_attn.v_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.35.cross_attn.k_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.35.cross_attn.o_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.35.cross_attn.q_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.35.cross_attn.v_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.35.mlp.down_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.35.mlp.gate_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.35.mlp.up_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.35.post_cross_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.35.post_feedforward_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.35.post_self_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.35.pre_cross_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.35.pre_feedforward_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.35.pre_self_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.35.self_attn.k_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.35.self_attn.o_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.35.self_attn.q_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.35.self_attn.v_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.36.cross_attn.k_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.36.cross_attn.o_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.36.cross_attn.q_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.36.cross_attn.v_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.36.mlp.down_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.36.mlp.gate_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.36.mlp.up_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.36.post_cross_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.36.post_feedforward_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.36.post_self_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.36.pre_cross_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.36.pre_feedforward_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.36.pre_self_attn_layernorm.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.36.self_attn.k_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.36.self_attn.o_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.36.self_attn.q_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.36.self_attn.v_proj.weight": "model-00008-of-00009.safetensors",
    "model.decoder.layers.37.cross_attn.k_proj.weight": "model-00009-of-00009.safetensors",
    "model.decoder.layers.37.cross_attn.o_proj.weight": "model-00009-of-00009.safetensors",
    "model.decoder.layers.37.cross_attn.q_proj.weight": "model-00009-of-00009.safetensors",
    "model.decoder.layers.37.cross_attn.v_proj.weight": "model-00009-of-00009.safetensors",
    "model.decoder.layers.37.mlp.down_proj.weight": "model-00009-of-00009.safetensors",
    "model.decoder.layers.37.mlp.gate_proj.weight": "model-00009-of-00009.safetensors",
